Hi, we had the case again yesterday, here is some details we had, terraform plan before apply:

```
Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.


─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # akamai_dns_record.ak-a-records["springcm.com#inboundeu21.springcm.com"] will be created
  + resource "akamai_dns_record" "ak-a-records" {
      + answer_type = (known after apply)
      + dns_name    = (known after apply)
      + id          = (known after apply)
      + name        = "inboundeu21.springcm.com"
      + record_sha  = (known after apply)
      + recordtype  = "A"
      + serial      = (known after apply)
      + target      = [
          + "31.186.230.163",
        ]
      + ttl         = 300
      + zone        = "springcm.com"
    }

  # akamai_dns_record.ak-cname-records["springcm.com#inboundeu21.springcm.com"] will be destroyed
  # (because key ["springcm.com#inboundeu21.springcm.com"] is not in for_each map)
  - resource "akamai_dns_record" "ak-cname-records" {
      - id         = "springcm.com#inboundeu21.springcm.com#CNAME" -> null
      - name       = "inboundeu21.springcm.com" -> null
      - record_sha = "ef9c44a44448da00cc4c48ea4208f5235b49356a" -> null
      - recordtype = "CNAME" -> null
      - target     = [
          - "origin-c-inboundeu21.springcm.com.",
        ] -> null
      - ttl        = 300 -> null
      - zone       = "springcm.com" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

Then terraform apply failure:

```
Starting: Terraform apply
==============================================================================
Task         : Terraform CLI
Description  : Execute terraform cli commands
Version      : 0.7.8
Author       : Charles Zipp
Help         : 
==============================================================================
/usr/bin/terraform version
Terraform v1.2.9
on linux_amd64
+ provider registry.terraform.io/akamai/akamai v3.2.1
+ provider registry.terraform.io/hashicorp/local v2.3.0

Your version of Terraform is out of date! The latest version
is 1.5.7. You can update by downloading from https://www.terraform.io/downloads.html
/usr/bin/terraform apply -auto-approve -parallelism=50 -input=false -lock=true -lock-timeout=360s tfplan-production.zip
╷
│ Warning: "use_microsoft_graph": [DEPRECATED] This field now defaults to `true` and will be removed in v1.3 of Terraform Core due to the deprecation of ADAL by Microsoft.
│ 
│ 
╵
akamai_dns_record.ak-cname-records["springcm.com#inboundeu21.springcm.com"]: Destroying... [id=springcm.com#inboundeu21.springcm.com#CNAME]
akamai_dns_record.ak-a-records["springcm.com#inboundeu21.springcm.com"]: Creating...
akamai_dns_record.ak-cname-records["springcm.com#inboundeu21.springcm.com"]: Destruction complete after 1s
╷
│ Error: Recordset create failure
│ 
│   with akamai_dns_record.ak-a-records["springcm.com#inboundeu21.springcm.com"],
│   on a.tf line 32, in resource "akamai_dns_record" "ak-a-records":
│   32: resource "akamai_dns_record" "ak-a-records" {
│ 
│ Title: Invalid rdata - CNAME collision; Type:
│ https://problems.luna.akamaiapis.net/authoritative-dns/cnameCollision;
│ Detail: CNAME must be the only record for a given name
╵
##[error]Terraform command 'apply' failed with exit code '1'.
##[error]╷
│ Error: Recordset create failure
│ 
│   with akamai_dns_record.ak-a-records["springcm.com#inboundeu21.springcm.com"],
│   on a.tf line 32, in resource "akamai_dns_record" "ak-a-records":
│   32: resource "akamai_dns_record" "ak-a-records" {
│ 
│ Title: Invalid rdata - CNAME collision; Type:
│ https://problems.luna.akamaiapis.net/authoritative-dns/cnameCollision;
│ Detail: CNAME must be the only record for a given name
|
```



